# --- Базовый миннимум ---
# Добавить сразу шифрование AES.
# Работает так же как goal manager только принимает сначала ссылку потом описание. 
# Есть опция Select - при которой копируется ссылка.
# Можно настроить вывод рандомных 10 ссылок.
# Ввести поиск (по всей программе?) в которой на ввод слово, а на выходе все индексы.
# --- Повыешние удобства и безопасности ---
# Автоматическая проверка работают ли ссылки?
# Настроить так же валидацию ввода и защиту от ошибок ввода по всей программе в целом.
# Стоит ли ввести какой то уровень API для всей программы в целом? Изучить вопрос централизации.
# При этом централизация не должна ударять по скорости и удобству взаимодействия
# Для публикации этого ПО нужно сделать его в целом более полезным для масс, более настраиваемым.
# Сделать ASCII логотип по приколу если делать нечего будет. Как они вообще делаются