import shutil

class Table():
    def __init__(self, tab_array):
        self.tab_array = tab_array
        #print("tab width is ", tab_width)
        #print("term width is", term_width.columns)

    def returnTable(self):
        tab_width = len(self.tab_array)
        term_width = shutil.get_terminal_size()
        for i in range(tab_width):
            print(self.tab_array[i])
        
# Как сделать принт без переноса строк
# Вычисление границ каждого отделения. Ширина высота для постановки спецсимволов.
# По сути спецсимвола 2. Огромная горизонтальная линия и вертикальная 1 палка.
# Можно придумать жирную линию и маленькую линию.

# --------------------------------------------------------------------------
# ==========================================================================
# <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
# ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
# ____________________________________________________________________________
#


obj = Table(["index", "cycles", "name", "result"])
print("hi", obj.returnTable())








